SloPOS/free-harvest/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- USB: act as a CDC-ACM *device* so the dryer (USB host) can enumerate us.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=1024
CONFIG_TINYUSB_CDC_TX_BUFSIZE=1024

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# Keep logs on UART0 so they do not collide with the USB CDC data path.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- Flash: this module has 8MB; use it so two OTA slots fit.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# --- OTA: custom two-slot partition table (partitions.csv).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Larger HTTP request buffers so the OTA upload handler is comfortable.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# --- OTA safety net: make a bad update undo itself.
#
# The bootloader rewrites any PENDING_VERIFY slot to ABORTED on every boot
# (bootloader_support/src/bootloader_utility.c), so an image that never calls
# esp_ota_mark_app_valid_cancel_rollback() is abandoned at the next reboot and
# the previous slot runs instead. main.c confirms only once the adapter is
# actually reachable, so an update that breaks Wi-Fi reverts itself rather than
# costing a trip to the machine with a USB cable.
#
# NOTE: this is enforced by the BOOTLOADER, which OTA never rewrites. It only
# takes effect after bootloader.bin has been physically flashed at 0x0 once.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y



# --- TinyUSB task stack.
#
# The CDC RX callback runs on this task, and our frame observer writes each
# frame to the SPIFFS capture log from there - fopen/fprintf/fclose through VFS
# and newlib is far more stack-hungry than the 4096 default allows. The first
# inbound frame overflowed it and panicked the chip, which looked exactly like
# "the dryer stopped talking to us": the adapter rebooted, re-enumerated, and
# reported zero bytes received because the counter reset with it.
CONFIG_TINYUSB_TASK_STACK_SIZE=8192
